In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [4]:
n_rows = 5
n_cols = 5
cols =tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows,n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  1  8  2  8  3
1  7  9  3  6  8
2  6  1  8  7  2
3  1  2  8  7  2
4  3  4  8  9  1

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  3  8  2  8  1
1  8  6  3  9  7
2  2  7  8  1  6
3  2  7  8  2  1
4  1  9  8  4  3

In [6]:
df.loc[::-1]

   A  B  C  D  E
4  3  4  8  9  1
3  1  2  8  7  2
2  6  1  8  7  2
1  7  9  3  6  8
0  1  8  2  8  3

In [7]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  4  8  9  1
1  1  2  8  7  2
2  6  1  8  7  2
3  7  9  3  6  8
4  1  8  2  8  3

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  8     2  8  3
1  7  9     3  6  8
2  6  1     8  7  2
3  1  2     8  7  2
4  3  4     8  9  1

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       8  2     8  3
1     7       9  3     6  8
2     6       1  8     7  2
3     1       2  8     7  2
4     3       4  8     9  1

In [24]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  tnATPY1CZs  0.390328  0.777814 -0.827884  0.923225
1  4lDjNGiitD  1.192660 -1.374392  0.561711  1.928149
2  KJEt4oh61S  0.807550       NaN -0.393687  0.450761
3  DT9pgu5uyl  1.229555       NaN -1.461438 -0.617308
4  p9tAakfKw6 -0.704086  0.420421 -0.024546 -1.093323

In [25]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  tnATPY1CZs  0.390328  0.777814 -0.827884  0.923225
1  4lDjNGiitD  1.192660 -1.374392  0.561711  1.928149
2  KJEt4oh61S  0.807550       NaN -0.393687  0.450761
3  DT9pgu5uyl  1.229555       NaN -1.461438 -0.617308
4  p9tAakfKw6 -0.704086  0.420421 -0.024546 -1.093323

In [26]:
df_backup = df.copy(deep=True)

In [27]:
df = df.dropna(axis='columns')
df.head()

            Z         C
0  tnATPY1CZs -0.827884
1  4lDjNGiitD  0.561711
2  KJEt4oh61S -0.393687
3  DT9pgu5uyl -1.461438
4  p9tAakfKw6 -0.024546

In [28]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  tnATPY1CZs  0.390328  0.777814 -0.827884  0.923225
1  4lDjNGiitD  1.192660 -1.374392  0.561711  1.928149
4  p9tAakfKw6 -0.704086  0.420421 -0.024546 -1.093323
5  On3bq26zpk  0.656284 -1.303133 -0.798839 -1.356626
6  ike1tlYtZj -0.287423 -0.272329  0.288096 -0.662326

In [29]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.033333
B    0.233333
C    0.000000
D    0.133333
dtype: float64

In [30]:
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         C
0  tnATPY1CZs  0.390328 -0.827884
1  4lDjNGiitD  1.192660  0.561711
2  KJEt4oh61S  0.807550 -0.393687
3  DT9pgu5uyl  1.229555 -1.461438
4  p9tAakfKw6 -0.704086 -0.024546

In [31]:
data = {'A':[15, 15, 18, np.nan, 12],
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [32]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [33]:
type(df['A'])

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df['A']==df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [36]:
df['A'].equals(df['B'])

True

In [37]:
df1 =df.copy(deep=True)

df.equals(df1)

True

In [38]:
df ==df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True